import React from "react";
import deobond from "../../Images//1200px-Darul_Uloom_Deoband.jpg";
import hathajari from "../../Images//prothomalo-bangla_2020-09_aaa47cec-f266-4b6e-83ba-9477f0aa3f6a_Hathazari.webp";

const Blog = () => {
  return (
    <div>
      <div class="relative block bg-black group lg:px-12 mb-28" href="">
        <img
          class="absolute inset-0 object-cover w-full h-full opacity-75 transition-opacity  group-hover:opacity-50 "
          src={deobond}
          alt=""
        />
        <div class="relative p-8">
          <p class="text-sm font-medium tracking-widest text-pink-500 uppercase">
            دارالعلوم دیوبند
          </p>

          <p class="text-2xl font-bold text-white">দারুল উলুম দেওবন্দ </p>

          <div class="mt-64">
            <div class="opacity-0 transition-all transform translate-y-8  group-hover:opacity-100 group-hover:translate-y-0">
              <p class="text-sm text-white">
                দারুল উলুম দেওবন্দ (হিন্দি: दारुल उलूम देवबन्द, আরবি ও উর্দু:
                دارالعلوم دیوبند‎‎) হল ভারতের একটি মাদরাসা। এখান থেকে দেওবন্দি
                আন্দোলনের সূত্রপাত হয়। উত্তর প্রদেশের সাহারানপুর জেলার দেওবন্দ
                নামক স্থানে এই মাদ্রাসার অবস্থান। ১৮৬৬ সালে বেশ কয়েকজন বিশিষ্ট
                ইসলামি পণ্ডিত এটির প্রতিষ্ঠা করেন। মুহাম্মদ কাসেম নানুতুবি তাদের
                প্রধান ছিলেন। অন্যান্যদের মধ্যে ছিলেন মাওলানা রশীদ আহমেদ
                গাঙ্গুহী ও সৈয়দ আবিদ হুসাইন। ইসলামি শিক্ষার প্রসারে এটি
                গুরুত্বপূর্ণ ভূমিকা রাখছে। এটি ভারতের মুসলিম সমাজের নানা অসংগতি,
                কুপ্রথা ও স্থানীয় আচরণকে সংস্কার করে শরিয়তের নৈতিকতা ও আদবকে
                প্রতিস্থাপন করতে পেরেছিল এবং মুসলিম সমাজের ইসলামায়ন
                প্রক্রিয়াকে একটি প্রাতিষ্ঠানিক রূপ দিয়েছিল। ঔপনিবেশিক ও
                অমুসলিম অধ্যুষিত ভারতে মুসলমানদোর ধর্ম ও সংস্কৃতিকে বাঁচিয়ে
                রাখার পথ দেখিয়েছে।
                <p class="text-lg font-medium tracking-widest text-pink-500 uppercase">
                  সূচনা
                </p>
                মসজিদে ছাত্তা দেওবন্দ ছিল মুহাম্মদ কাসেম নানুতুবির শ্বশুরালয়।
                সেখানে গেলে তিনি সাত্তা মসজিদে নামাজ আদায় করতেন। হাজী আবেদ
                হোসেন ছিলেন সাত্তা মসজিদের ইমাম। মাওলানা জুলফিকার আলী ও মাওলানা
                ফজলুর রহমান অত্র এলাকার বাসিন্দা ছিলেন। এসব ব্যক্তিবর্গ
                নামাযান্তে হাজী আবেদ হোসেনের হুজরায় প্রায় সমবেত হতেন। দেশের
                এহেন পরিস্থিতি তাদেরকেও ভাবিয়ে তুলেছিল ভীষণভাবে। তারা সবচেয়ে
                বেশি ভাবতেন ইসলামী শিক্ষার ভবিষ্যৎ নিয়ে! কিন্তু বিকল্প কোন পথ
                কেউ খুঁজে পাচ্ছিলেন না। দীর্ঘ ৬/৭ বছর এভাবে কেটে গেল। ১৮৬৬ সালে
                মাওলানা কাসেম নানুতুবী দেওবন্দের দেওয়ান মহল্লায় স্বীয়
                শ্বশুরবাড়িতে বেড়াতে আসেন। বাড়ি সংলগ্ন সাত্তা মসজিদের ইমাম
                হাজী আবিদ হোসানের সাথে মাদরাসা শিক্ষা নিয়ে দীর্ঘক্ষণ আলোচনা
                হওয়ার পর সেখানেই একটি মাদরাসা প্রতিষ্ঠার ব্যাপারে অভিমত ব্যক্ত
                করেন। একদিন সাত্তা মসজিদের ইমাম হাজী আবেদ হোসেন ফজরের নামাজান্তে
                ইশরাকের নামাজের অপেক্ষায় মসজিদে মোরাকাবারত ছিলেন। হঠাৎ তিনি
                ধ্যানমগ্নতা ছেড়ে দিয়ে নিজের কাঁধে রুমালের চার কোণ একত্রিত করে
                একটি থলি বানালেন এবং তাতে নিজের পক্ষ থেকে তিন টাকা রাখলেন। অতঃপর
                তা নিয়ে তিনি রওয়ানা হয়ে গেলেন মাওলানা মাহতাব আলীর কাছে। তিনি
                সোৎসাহে ৬ টাকা দিলেন এবং দোয়া করলেন। মাওলানা ফজলুর রহমান দিলেন
                ১২ টাকা, হাজী ফজলুল হক দিলেন ৬ টাকা। সেখান থেকে উঠে তিনি গেলেন
                মাওলানা জুলফিকার আলীর নিকট। জ্ঞানানুরাগী এই ব্যক্তিটি দিলেন ১২
                টাকা। সেখান থেকে উঠে এই দরবেশ সম্রাট “আবুল বারাকাত” মহল্লার দিকে
                রওয়ানা হলেন। এভাবে ২০০ টাকা জমা হয়ে গেল এবং সন্ধ্যা পর্যন্ত
                জমা হল ৩০০ টাকা। এভাবে বিষয়টি লোকমুখে চর্চা হতে বেশ টাকা জমে
                যায়। জনগণের উৎসাহ-উদ্দীপনা দেখে তিনি মিরাটে কর্মরত মাওলানা
                কাসেম নানুতুবির নিকট এই মর্মে পত্র লিখেন যে, আমরা মাদ্রাসার কাজ
                শুরু করে দিয়েছি আপনি অনতিবিলম্বে চলে আসুন। চিঠি পেয়ে নানুতুবী
                মোল্লা মাহমুদকে শিক্ষক নিযুক্ত করে পাঠিয়ে দিলেন এবং তার মাধ্যমে
                মাদ্রাসার কাজ চালিয়ে যাওয়ার কথা উল্লেখ করে চিঠি লিখে দিলেন।
                এভাবেই গণচাঁদার উপর ভিত্তি করে ছোট্ট একটি ডালিম গাছের নিচে
                দেওবন্দ মাদ্রাসার গোড়াপত্তন হয়। মোল্লা মাহমুদ সর্বপ্রথম
                শিক্ষাদান করেন সর্বপ্রথম ছাত্র মাহমুদকে। যিনি পরবর্তীতে শায়খুল
                হিন্দ মাহমুদ হাসান দেওবন্দি দেওবন্দী নামে ব্যাপক পরিচিতি লাভ
                করেন।
                <p class="text-lg font-medium tracking-widest text-pink-500 uppercase">
                  প্রতিষ্ঠাতা
                </p>
                দারুল উলুম দেওবন্দের প্রতিষ্ঠাতারা আকাবিরে সিত্তাহ নামে পরিচিত।
                আকাবিরে সিত্তাহ (আরবি: ﺃﻛﺎﺑﺮ السته‎‎) শব্দটি দুটি আরবি শব্দ
                নিয়ে গঠিত। আকাবির ও সিত্তাহ। আকবার শব্দের বহুবচন আকাবির। এর
                অর্থ বড় ব্যক্তিত্ব, সম্মানিত ব্যক্তি। আর সিত্তাহ শব্দের অর্থ
                ছয়।সুতরাং আকাবিরে সিত্তাহ’র শাব্দিক অর্থ ছয়জন সম্মানিত
                ব্যক্তি। পারিভাষিক অর্থে আকাবিরে সিত্তাহ বলতে দেওবন্দ আন্দোলন
                তথা দারুল উলুম দেওবন্দের প্রতিষ্ঠাতা ছয়জন ব্যক্তিকে বোঝায়। ছয়
                মনীষীর নামঃ মুহাম্মদ কাসেম, মুহাম্মদ ইয়াকুব , মুহাম্মদ আবেদ,রফি
                উদ্দিন , যুলফিকার আলী , ফজলুর রহমান
              </p>
            </div>
          </div>
        </div>
      </div>
      <div class="relative block bg-black group lg:px-12" href="">
        <img
          class="absolute inset-0 object-cover w-full h-full opacity-75 transition-opacity  group-hover:opacity-50 "
          src={hathajari}
          alt=""
        />
        <div class="relative p-8">
          <p class="text-sm font-medium tracking-widest text-pink-500 uppercase">
          الجامعة الأهلية دار العلوم معين الإسلام
          </p>

          <p class="text-2xl font-bold text-white">আল জামিয়াতুল আহলিয়া দারুল উলুম মুঈনুল ইসলাম  </p>

          <div class="mt-64">
            <div class="opacity-0 transition-all transform translate-y-8  group-hover:opacity-100 group-hover:translate-y-0">
              <p class="text-sm text-white">
              আল জামিয়াতুল আহলিয়া দারুল উলুম মুঈনুল ইসলাম সংক্ষেপে হাটহাজারী মাদ্রাসা বাংলাদেশের চট্টগ্রাম জেলার হাটহাজারী উপজেলায় অবস্থিত একটি কওমি মাদ্রাসা। এটি বাংলাদেশের সর্ববৃহৎ ও সর্বপ্রাচীন কওমি মাদ্রাসা।[১] আব্দুল ওয়াহেদ বাঙ্গালী, হাবিবুল্লাহ কুরাইশি, সুফি আজিজুর রহমান ও আব্দুল হামিদের সম্মিলিত প্রচেষ্টায় এবং আশরাফ আলী থানভীর অনুমতিতে ১৯০১ সালে এটি প্রতিষ্ঠিত হয়। এটি বাংলাদেশে দারুল উলুম দেওবন্দের আদলে প্রতিষ্ঠিত প্রথম মাদ্রাসা, যা আহলে সুন্নাত ওয়াল জামাতের আদর্শ ও চিন্তাধারা মোতাবেক পরিচালিত হয়। তাই এটি বাংলাদেশে দ্বিতীয় দারুল উলুম দেওবন্দ নামেও খ্যাত।[৫] এটি বাংলাদেশের প্রথম দাওরায়ে হাদিস মাদ্রাসা এবং এখনও বাংলাদেশে হাদিস শিক্ষার প্রধান কেন্দ্র।[৬][৭] এই মাদ্রাসার অনুকরণে বিপুল সংখ্যক মাদ্রাসা প্রতিষ্ঠিত হওয়ায় এ মাদ্রাসাকে উম্মুল মাদারিস বা মাদ্রাসার জননীরূপে আখ্যায়িত করা হয়।[৮][৯] এটি বেফাকুল মাদারিসিল আরাবিয়া বাংলাদেশের অধিভুক্ত।[১০] মাসিক মুঈনুল ইসলাম এই মাদ্রাসার মুখপত্র।
                <p class="text-lg font-medium tracking-widest text-pink-500 uppercase">
                প্রেক্ষাপট
                </p>
                দারুল উলুম হাটহাজারীর প্রাতিষ্ঠানিক ওয়েবসাইটের বিবৃতি মতে, মাদ্রাসাটি প্রতিষ্ঠার প্রেক্ষাপট ছিল ওই অঞ্চলে তৎকালীন মুসলিম সমাজের ইসলাম সম্পর্কে অজ্ঞতা ও ইসলামি শিক্ষা-সংস্কৃতির প্রতিকূল অবস্থা। মুসলমানদের এ অবস্থা পর্যবেক্ষণ করে চট্টগ্রাম জেলার কয়েকজন আলেম দারুল উলুম দেওবন্দের অনুকরণে এই মাদ্রাসাটি প্রতিষ্ঠার সিদ্ধান্ত গ্রহণ করেন।[৪]
                <p class="text-lg font-medium tracking-widest text-pink-500 uppercase">
                শিক্ষার্থী
                </p>
                দারুল উলুম হাটহাজারীর ছাত্রসংখ্যা প্রায় ৮০০০ জন। দাওরায়ে হাদিস বা স্নাতকোত্তর শ্রেণীতে অধ্যয়নরত রয়েছে ২৩১৮ জন।[১] ২০২২ সালে প্রায় ২৫০০ জন দাওরায়ে হাদিস সমাপ্তকারী শিক্ষার্থীকে সাম্মানিক পাগড়ি প্রদান করা হয়।[২] দারুল উলুম হাটহাজারীর উল্লেখযোগ্য প্রাক্তন শিক্ষার্থীদের মধ্যে রয়েছে: শাহ আবদুল ওয়াহহাব, শাহ আহমদ হাসান, ছিদ্দিক আহমদ, হাজী মুহাম্মদ ইউনুস, শাহ আহমদ শফী, হারুন বাবুনগরী, মুহিব্বুল্লাহ বাবুনগরী, জুনায়েদ বাবুনগরী, মুফতি ফয়জুল্লাহ, জমির উদ্দিন নানুপুরী, মুফতি আবদুর রহমান, আশরাফ আলী বিশ্বনাথী, নুরুল ইসলাম জিহাদী, মিজানুর রহমান সাঈদ, জিয়া উদ্দিন, ইয়াহইয়া আলমপুরী, জাফরুল্লাহ খান ও সাজিদুর রহমান প্রমুখ।
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default Blog;
